fortran90/doc/readme.org
#+TITLE: 2-D vortex patch fortran 90 program
#+AUTHOR: Tae Eun Kim
#+STARTUP: indent
* Todo's
 - [X] Useful general modules
   - [X] constants: pi, i, e, line(---...), ...
   - [X] function(vnorm) 1-norm / 2-norm / +infinity-norm+
   - [X] subroutines: linspace (a+(b-a)*i/n, i=0,n) and linspace1 (a+(b-a)*i/n, i=0,n-1)
   - [X] subroutines: timestamp
 - [X] subroutines and functions
   - [X] reading and writing data
   - [X] point evaluation
   - [X] velocity (integration) - new version with efficient alternating point quadrature
   - [X] residual (as a function)
   - [X] vsolver -  newton continuation
   - [X] c_0 calculation
   - [X] transfer matrix M calculation - efficient version using fft
   - [X] j(nu) calculation
 - [X] newton continuation method
   - [X] LINPACK
   - [X] LAPACK
   - [X] save solution
 - [-] fft
   - [X] Using fftw
   - [X] double Fourier series: two 1-D FFT & one 2-D FFT
   - [ ] FFT based on shifted ponits
   - [ ] Self-contained code? Is it possible?
 - [X] Is it possible to compile files in subdirectory and to save
   binary files in a subdirectory? - see below
 - [ ] Find out why coefficients have discrepancy (~1e-12) between matlab and fortran
 - [ ] plotting using gnuplot
* Directory organization
** Project directory
#+BEGIN_SRC shell :results verbatim
  tree -d ../
#+END_SRC

#+RESULTS:
#+begin_example
../
├── data
├── doc
├── src
├── test
│   ├── fftpack
│   ├── fftw
│   ├── gnufor
│   └── linpack
└── tmp

11 directories
#+end_example

** ☛ TODO More specialized and cleaner structure
See if I can clean it up more using functionalities of =make=.
#+begin_example
../
├── data
├── doc
├── src
├── bin
├── obj
└── fig

6 directories
#+end_example
* Program organization
** Modules
*ISSUE.* When tangled, emacs automatically wraps the module file with =program main= and =end program main=, which need to be deleted manually.
*** Constants
 - set real kind (single or double precition)
 - pi, i, eps
*** Basic routines - printing, linspace, etc
 - [SR] writing complex data
 - [FN] linspace, linspace1, linspaceh
 - [FN] identity matrix, zero array constructor
 - [FN] vector infinity-norm calculator
 - [FN] generating data filename
 - [SR] time stamp
 - [FN] matrix infinity-norm calculator
 - [SR] generating data filename
*** Notes:
 - When a function defined externally outside the main program, it appears that gfortran compiler wants to have an =interface= block. In case a function defined in a module is called, it works fine without =interface= block.
** Main program
*** solver program
*** transfer matrix calculation
*** fft program
*** calculation of bounds
*** testing program
** Subroutines and functions
*** Reading data
*** Writing data
*** Point evaluation
*** Velocity calculation
*** Residual calculation
*** Vortex patch solver (Newton continuation)
*** FFT and $T$-matrix calculation
* Data file structure
** Naming convention
=vp_bI_nEE_rDDDD.dat= where
 - =bI= describes how $\beta$ value was obtained:
   I = 0 : $\beta = 0$
   I = 1 : $\beta = (1 - \sqrt{1-\rho^2})/\rho$
   I = 2 : $\beta = (1 - 2\sqrt{1-\rho^2})/\rho$
 - =nEE= indicates that $n = 2^{\rm EE}$.
 - =rDDDD= represents the value of $\rho = 0.{\rm DDDD}$.
** Example
An example data file =vp_b0_n07_r5000.dat= may look like
  |   line |                    file | note    |
  |--------+-------------------------+---------|
  |      1 |                     128 | n       |
  |      2 |                  0.5000 | rho     |
  |      3 |                  0.0000 | beta    |
  |      4 |  2.7814117251577763E-01 | U       |
  |      5 |  2.3675575948962696E-01 | a_1     |
  |      6 | -6.6992137885540828E-02 | a_2     |
  | \vdots |                  \vdots | \vdots  |
  |    131 |  2.8142318944085296E-20 | a_{n-1} |

Our =data= directory looks like this:
#+BEGIN_SRC shell :results verbatim
  tree ../data
#+END_SRC

#+RESULTS:
#+begin_example
../data
├── vp_b0_n02_r0500.dat
├── vp_b0_n07_r1000.dat
├── vp_b0_n07_r1500.dat
├── vp_b0_n07_r2000.dat
├── vp_b0_n07_r2500.dat
├── vp_b0_n07_r3000.dat
├── vp_b0_n07_r3500.dat
├── vp_b0_n07_r4000.dat
├── vp_b0_n07_r4500.dat
├── vp_b0_n07_r5000.dat
├── vp_b0_n07_r5500.dat
├── vp_b0_n07_r6000.dat
├── vp_b0_n07_r6500.dat
├── vp_b0_n07_r7000.dat
├── vp_b0_n07_r7500.dat
├── vp_b0_n07_r8000.dat
├── vp_b0_n07_r8500.dat
├── vp_b0_n07_r9000.dat
├── vp_b1_n07_r1000.dat
├── vp_b1_n07_r1500.dat
├── vp_b1_n07_r2000.dat
├── vp_b1_n07_r2500.dat
├── vp_b1_n07_r3000.dat
├── vp_b1_n07_r3500.dat
├── vp_b1_n07_r4000.dat
├── vp_b1_n07_r4500.dat
├── vp_b1_n07_r5000.dat
├── vp_b1_n07_r5500.dat
├── vp_b1_n07_r6000.dat
├── vp_b1_n07_r6500.dat
├── vp_b1_n07_r7000.dat
├── vp_b1_n07_r7500.dat
├── vp_b1_n07_r8000.dat
├── vp_b1_n07_r8500.dat
├── vp_b1_n07_r9000.dat
├── vp_b1_n07_r9500.dat
├── vp_b1_n08_r9550.dat
├── vp_b1_n08_r9600.dat
├── vp_b1_n08_r9650.dat
├── vp_b1_n08_r9700.dat
├── vp_b1_n08_r9750.dat
├── vp_b1_n08_r9800.dat
├── vp_b1_n08_r9850.dat
├── vp_b1_n08_r9900.dat
├── vp_b2_n09_r9900.dat
└── vp_b2_n09_r9910.dat

0 directories, 46 files
#+end_example

Here is one of the actual data file:
#+BEGIN_SRC shell :results verbatim
  cat ../data/vp_b0_n07_r1000.dat
#+END_SRC

#+RESULTS:
#+begin_example
                      128
                   0.1000
                   0.0000
   1.0001985238346446E-02
   1.9809133348409310E-03
  -1.0000858472935735E-04
   6.6683516336685552E-06
  -5.0012116471127812E-07
   4.0009370843306072E-08
  -3.3340959588259235E-09
   2.8577851784922028E-10
  -2.5005545957988990E-11
   2.2227082415510279E-12
  -2.0004350213467846E-13
   1.8185235725188539E-14
  -1.6662525732789802E-15
   1.5531656430992159E-16
  -1.2245439461365472E-17
  -1.5122638262141917E-18
  -9.8581567198107532E-20
   1.3130727372372129E-19
   3.4424588989610574E-19
  -5.4525318213407985E-19
  -3.4762366271456936E-19
  -4.2449219251226118E-19
   6.7433792389466774E-19
  -5.8723576038217422E-19
   6.3156260051518001E-19
  -4.5736539408374951E-19
  -2.0413157867351780E-19
   2.6165203994365787E-19
  -2.6321805017442715E-19
  -1.2252306377680363E-18
   4.3836673439895043E-19
  -8.7353383701641890E-19
  -3.9503714914894100E-19
  -1.0165597231921565E-18
   8.2188536809723563E-19
  -2.3563217767738871E-19
   8.1362969058322308E-19
   3.7742018718630499E-19
   2.7736818532568190E-19
  -8.2410121569954551E-20
   8.9449875187272598E-20
   7.0042414294916915E-19
  -6.0739397844888839E-19
   3.4066447738558499E-19
  -2.7803860287194567E-19
   2.1684718927630965E-19
  -3.3987499637572566E-19
   7.5253998427381169E-19
   2.4534439636169446E-19
  -4.4663158628361645E-19
   4.3773770947642855E-19
  -7.4162485276120595E-20
   1.8270458196597969E-19
   2.9537468509671182E-19
  -3.9144196915598417E-19
  -3.5726009853028923E-20
  -2.6262479856436225E-19
   2.1596016597203870E-19
  -2.7895042547153905E-19
   1.1028427359198636E-19
  -1.3074013901282978E-19
  -1.5868251511149807E-19
   1.3831022769522467E-19
  -3.4768664456523396E-19
  -1.7944033382136967E-19
  -4.9631203642767744E-19
  -3.4692491518251528E-20
  -8.1221686523245157E-20
   1.9718181405189956E-19
   8.8312009299403459E-20
  -3.1680376135385805E-20
   5.2870768611451540E-19
  -4.5440769601349278E-19
  -2.0456149358123099E-19
   4.7430076881465150E-19
  -4.4422465207598409E-19
  -2.6824389263628222E-19
   7.4607244901575860E-20
   8.8912581622369697E-20
  -1.4357551816073925E-19
   7.2464552603528455E-20
  -3.6104105556462499E-19
   3.0214912599074517E-19
  -4.4201213256293304E-19
   1.3541471477657501E-19
  -2.0534197880119409E-19
  -6.6609158277143670E-20
   4.7656928224585952E-19
  -4.1967186790694660E-19
   6.3691654710913881E-19
  -3.2999928706794195E-19
   8.2844764678029621E-20
   2.1626292003838460E-19
  -1.0632810194132693E-19
  -1.9356025972423106E-19
   1.8729201968063238E-20
   1.6871041788451883E-19
  -1.3711917905854746E-19
  -1.8262480608640534E-19
   2.3893677221863487E-19
  -1.0653670767574076E-19
   8.2644294497262993E-21
  -2.9282308071074542E-19
   1.3184013619315692E-19
  -1.3237950134786646E-19
  -2.0803799057010735E-19
  -4.9463909462429991E-20
   1.2377928808689879E-19
  -1.9414852359052405E-19
   7.2945276879031268E-20
   1.7138673346351712E-19
  -3.1471782140513801E-19
   6.7141659127267712E-20
  -2.5282639933832479E-20
  -1.8261118809875368E-19
  -5.7123474198186214E-20
  -9.9190524753007495E-20
   2.2402114607246495E-19
  -1.4182977195492378E-19
   7.0220645816393788E-20
   1.0196169565679633E-19
  -1.5659303112198508E-19
   3.2817737058090524E-19
  -1.0330545040433233E-19
   1.3266175306270433E-19
   6.0096918781203959E-20
   2.1642791859063117E-20
  -1.7703410770086136E-20
#+end_example

* LINPACK
** Useful subroutines: double precision
 - DGECO: calculates condition number
 - DGEDI: calculates determinant
 - DGESL: solves A*X = B
