fortran90/doc/readme.tex
% Created 2018-03-07 Wed 13:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Tae Eun Kim}
\date{\today}
\title{2-D vortex patch fortran 90 program}
\hypersetup{
 pdfauthor={Tae Eun Kim},
 pdftitle={2-D vortex patch fortran 90 program},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.6)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Todo's}
\label{sec:org5b38cc3}
\begin{itemize}
\item[{$\boxtimes$}] Useful general modules
\begin{itemize}
\item[{$\boxtimes$}] constants: pi, i, e, line(---\ldots{}), \ldots{}
\item[{$\boxtimes$}] function(vnorm) 1-norm / 2-norm / \sout{infinity-norm}
\item[{$\boxtimes$}] subroutines: linspace (a+(b-a)*i/n, i=0,n) and linspace1 (a+(b-a)*i/n, i=0,n-1)
\item[{$\boxtimes$}] subroutines: timestamp
\end{itemize}
\item[{$\boxtimes$}] subroutines and functions
\begin{itemize}
\item[{$\boxtimes$}] reading and writing data
\item[{$\boxtimes$}] point evaluation
\item[{$\boxtimes$}] velocity (integration) - new version with efficient alternating point quadrature
\item[{$\boxtimes$}] residual (as a function)
\item[{$\boxtimes$}] vsolver -  newton continuation
\item[{$\boxtimes$}] c\(_{\text{0}}\) calculation
\item[{$\boxtimes$}] transfer matrix M calculation - efficient version using fft
\item[{$\boxtimes$}] j(nu) calculation
\end{itemize}
\item[{$\boxtimes$}] newton continuation method
\begin{itemize}
\item[{$\boxtimes$}] LINPACK
\item[{$\boxtimes$}] LAPACK
\item[{$\boxtimes$}] save solution
\end{itemize}
\item[{$\boxminus$}] fft
\begin{itemize}
\item[{$\boxtimes$}] Using fftw
\item[{$\boxtimes$}] double Fourier series: two 1-D FFT \& one 2-D FFT
\item[{$\square$}] FFT based on shifted ponits
\item[{$\square$}] Self-contained code? Is it possible?
\end{itemize}
\item[{$\boxtimes$}] Is it possible to compile files in subdirectory and to save
binary files in a subdirectory? - see below
\item[{$\square$}] Find out why coefficients have discrepancy (\textasciitilde{}1e-12) between matlab and fortran
\item[{$\square$}] plotting using gnuplot
\end{itemize}
\section{Directory organization}
\label{sec:org6d95a01}
\subsection{Project directory}
\label{sec:org46af9f0}
\begin{minted}[]{shell}
tree -d ../
\end{minted}

\subsection{{\bfseries\sffamily ☛ TODO} More specialized and cleaner structure}
\label{sec:org0e31fc4}
See if I can clean it up more using functionalities of \texttt{make}.
\begin{verbatim}
../
├── data
├── doc
├── src
├── bin
├── obj
└── fig

6 directories
\end{verbatim}
\section{Program organization}
\label{sec:org028dfb7}
\subsection{Modules}
\label{sec:org04d2a7d}
\textbf{ISSUE.} When tangled, emacs automatically wraps the module file with \texttt{program main} and \texttt{end program main}, which need to be deleted manually.
\subsubsection{Constants}
\label{sec:org5e7249f}
\begin{itemize}
\item set real kind (single or double precition)
\item pi, i, eps
\end{itemize}
\subsubsection{Basic routines - printing, linspace, etc}
\label{sec:orga952248}
\begin{itemize}
\item\relax [SR] writing complex data
\item\relax [FN] linspace, linspace1, linspaceh
\item\relax [FN] identity matrix, zero array constructor
\item\relax [FN] vector infinity-norm calculator
\item\relax [FN] generating data filename
\item\relax [SR] time stamp
\item\relax [FN] matrix infinity-norm calculator
\item\relax [SR] generating data filename
\end{itemize}
\subsubsection{Notes:}
\label{sec:orgad8991a}
\begin{itemize}
\item When a function defined externally outside the main program, it appears that gfortran compiler wants to have an \texttt{interface} block. In case a function defined in a module is called, it works fine without \texttt{interface} block.
\end{itemize}
\subsection{Main program}
\label{sec:org715b463}
\subsubsection{solver program}
\label{sec:org6e7e368}
\subsubsection{transfer matrix calculation}
\label{sec:org664a940}
\subsubsection{fft program}
\label{sec:orga40ca8c}
\subsubsection{calculation of bounds}
\label{sec:orgf1a23b1}
\subsubsection{testing program}
\label{sec:orgcc15a15}
\subsection{Subroutines and functions}
\label{sec:orgf899ab8}
\subsubsection{Reading data}
\label{sec:org1f5f3da}
\subsubsection{Writing data}
\label{sec:orgaa61298}
\subsubsection{Point evaluation}
\label{sec:org59c08b9}
\subsubsection{Velocity calculation}
\label{sec:org4d5ae3b}
\subsubsection{Residual calculation}
\label{sec:org17ab98d}
\subsubsection{Vortex patch solver (Newton continuation)}
\label{sec:org5ec0355}
\subsubsection{FFT and \$T\$-matrix calculation}
\label{sec:org15010ea}
\section{Data file structure}
\label{sec:org18b491a}
\subsection{Naming convention}
\label{sec:orgec1d30d}
\texttt{vp\_bI\_nEE\_rDDDD.dat} where
\begin{itemize}
\item \texttt{bI} describes how \(\beta\) value was obtained:
I = 0 : \(\beta = 0\)
I = 1 : \(\beta = (1 - \sqrt{1-\rho^2})/\rho\)
I = 2 : \(\beta = (1 - 2\sqrt{1-\rho^2})/\rho\)
\item \texttt{nEE} indicates that \(n = 2^{\rm EE}\).
\item \texttt{rDDDD} represents the value of \(\rho = 0.{\rm DDDD}\).
\end{itemize}
\subsection{Example}
\label{sec:org83e5060}
An example data file \texttt{vp\_b0\_n07\_r5000.dat} may look like
\begin{center}
\begin{tabular}{rrl}
line & file & note\\
\hline
1 & 128 & n\\
2 & 0.5000 & rho\\
3 & 0.0000 & beta\\
4 & 2.7814117251577763\,(-01) & U\\
5 & 2.3675575948962696\,(-01) & a\(_{\text{1}}\)\\
6 & -6.6992137885540828\,(-02) & a\(_{\text{2}}\)\\
\vdots & \vdots & \vdots\\
131 & 2.8142318944085296\,(-20) & a\(_{\text{n-1}}\)\\
\end{tabular}
\end{center}

Our \texttt{data} directory looks like this:
\begin{minted}[]{shell}
tree ../data
\end{minted}

Here is one of the actual data file:
\begin{minted}[]{shell}
cat ../data/vp_b0_n07_r1000.dat
\end{minted}

\section{LINPACK}
\label{sec:org04b268f}
\subsection{Useful subroutines: double precision}
\label{sec:org8da3aed}
\begin{itemize}
\item DGECO: calculates condition number
\item DGEDI: calculates determinant
\item DGESL: solves A*X = B
\end{itemize}
