fortran90/doc/readme.org
** Example
#+BEGIN_SRC fortran
  integer :: n                  ! order of matrix A = JAC
  integer :: lda = n            ! leading dimension of A
  integer :: ipvt(n)            ! pivot indices
  integer :: job = 0
  real(rk) :: rcond
  real(rk) :: z(n)
  real(rk) :: jac(n,n)
  !
  ! linear algebra routines (LINPACK) ----------------------------
  !
  call DGECO(jac, lda, n, ipvt, rcond, z)
  ! LU-factors JAC and estimates RCOND;
  ! JAC, on return, provides L and U
  ! IPVT is the pivot indices;
  ! Z is a work vector;
  call DGESL(jac, n, n, ipvt, res, job)
  ! Solves JAC*X = RES; on return, RES is the solution;
  ! JOB = 0 for non-transposed problem
#+END_SRC
** Notes
 - When using Burkardt's =linpack_d.f90=, make sure to link =lapack=
   as it is not self-contained.
   #+BEGIN_EXAMPLE
     gfortran -o main.exe main.f90 linpack_d.f90 -framework Accelerate
   #+END_EXAMPLE
 - However, the quadruple precision library =linpack_q.f90= is
   self-contained:
   #+BEGIN_EXAMPLE
     gfortran -o main.exe main.f90 linpack_q.f90
   #+END_EXAMPLE
 - When using =linpack=, compile with either
   - [[file:~/Dropbox/src/linpack.f][linpack.f]] (Fortran77)
   - [[file:~/Dropbox/src/linpack_d.f90][linpack_d.f90]] (Fortran90) with =-framework Accelerate= flag.
   Even if the main program follows Fortran90 standards, =linpack.f=
   works seamlessly.
 - *Update* The source files =linpack*= are simply collection of
   routines (dependencies) required for =DGECO=, =DGEDI=, and
   =DGESL=. Some of them are again dependent on some routines of
   =blas= library. The required routines are identified and combined
   into a single source file for both =linpack= and =lapack=.

* LAPACK (modern)
** Using LAPACK in Mac
Mac supplies a copy of LAPACK compiled and optimized for Apple hardwares
and it is easily available as a library. In order to link/load the
library, include =-framework Accelerate= compilation flag, e.g.,
#+BEGIN_SRC shell
  gfortran -o myprog.exe myprog.f90 -framework Accelerate
#+END_SRC

The library is located in the system directory [[file:/System/Library/Frameworks/Accelerate.framework/][/System/Library/Framework]].

** Useful subroutines and their usage
Let $A \in \mathbb{R}^{n \times n}$.
 - DGETRF: LU-factorization of $A$
 - DGECON: calculates condition number of $A$
 - DGETRI: calculates the inverse $A^{-1}$ using LU-decomposition
 - DGETRS: solves $A x = b$ via Gaussian elimination, i.e. LU-factorization

 #+BEGIN_SRC fortran
     integer :: m                  ! number of rows
     integer :: n                  ! number of columns
     real(8) :: a(lda,n)           ! matrix A; on exit, factors L and U
     integer :: lda                ! leading dimension of A
     integer :: ipiv(n)            ! ivot indices, dimension = min(m,n)
     integer :: info               ! 0 for successful exit
     call dgetrf(m, n, a, lda, ipiv, info)
 #+END_SRC

 #+BEGIN_SRC fortran
     character*1 :: norm            ! '1' for 1-norm; 'I' for infinity-norm
     integer :: n                   ! order of matrix
     real(8) :: a(lda,n)            ! matrix/array A
     integer :: lda                 ! leading dimension of A
     real(8) :: anorm               ! 1-norm or infinity-norm of A; it is an input
     real(8) :: rcond               ! rcond  = 1/(norm(A)norm(A^{-1}))
     real(8) :: work(4*n)           ! double array
     integer :: iwork(n)            ! integer array
     integer :: info                ! 0 for successful exit
     call dgecon(norm, n, a, lda, anorm, rcond, work, iwork, info)
 #+END_SRC

 #+BEGIN_SRC fortran
     character*1 :: trans        ! form of the S.O.E.; 'N' for no transpose
     integer :: n                ! order of matrix A
     integer :: nrhs             ! number of right-hand side
     real(8) :: a(lda,n)         ! matrix A
     integer :: lda              ! leading dimension of A
     integer :: ipiv(n)          ! pivot indices
     real(8) :: b(ldb,nrhs)      ! right-hand side; on exit, returns the solution X
     integer :: ldb              ! leading dimension of A
     integer :: info             ! 0 for successful exit
     call dgetrs(trans, n, nrhs, a, lda, ipiv, b, ldb, info)
 #+END_SRC
 - *Note.* One of the inputs, =anorm=, for =dgecon= must be calculated
   before calling the routine. A function calculating matrix
   infinity-norm has been included in my module, currently named as
   =mnorm=.

** Example snippet

#+BEGIN_SRC fortran
    ! for lapack routines
    integer :: n
    integer :: lda = n
    integer :: ldb = n
    integer :: lwork = 4*n
    integer :: info
    integer :: ipiv(n)
    integer :: iwork(n)
    real(rk) :: anorm
    real(rk) :: rcond
    real(rk) :: work(lwork)

    ! linear algebra routines (LAPACK) -------------------------------
    anorm = mnorm(n, n, jac)   ! matrix infinity-norm
    ! calculating infinity norm of matrix JAC
    call DGETRF(n, n, jac, lda, ipiv, info)
    call DGECON('O', n, jac, lda, anorm, rcond, work, iwork, info)
    call DGETRS('N', n, 1, jac, lda, ipiv, res, ldb, info)
#+END_SRC

* FFTW
** Installation and basic usage
On Mac, I used =homebrew=
#+BEGIN_SRC shell
  brew install fftw
#+END_SRC

The files =libfftw3xxx.a= are saved in [[file:/usr/local/lib/][/usr/local/lib]] directory. At link time, use =-l= flag as follows:
#+BEGIN_SRC shell
  gfortran -o myprog.exe myprog.f90 -lfftw3
#+END_SRC

The program file =myprog.f90= should contain a line
#+BEGIN_SRC fortran
    include "fftw3.f90"
#+END_SRC
which declares variables used.

On my linux machine running ArchLinux, I installed it using =packer=:
#+BEGIN_SRC shell
  packer fftw fftw-quad
#+END_SRC

** Variable declaration
The file =fftw3.f90= declares variables needed for execution of =fftw= routines:
#+BEGIN_SRC shell :results output
  cat ../src/fftw3.f90
#+END_SRC

#+RESULTS:
#+begin_example
  integer ( kind = 4 ), parameter :: fftw_r2hc = 0
  integer ( kind = 4 ), parameter :: fftw_hc2r = 1
  integer ( kind = 4 ), parameter :: fftw_dht = 2
  integer ( kind = 4 ), parameter :: fftw_redft00 = 3
  integer ( kind = 4 ), parameter :: fftw_redft01 = 4
  integer ( kind = 4 ), parameter :: fftw_redft10 = 5
  integer ( kind = 4 ), parameter :: fftw_redft11 = 6
  integer ( kind = 4 ), parameter :: fftw_rodft00 = 7
  integer ( kind = 4 ), parameter :: fftw_rodft01 = 8
  integer ( kind = 4 ), parameter :: fftw_rodft10 = 9
  integer ( kind = 4 ), parameter :: fftw_rodft11 = 10
  integer ( kind = 4 ), parameter :: fftw_forward = -1
  integer ( kind = 4 ), parameter :: fftw_backward = +1
  integer ( kind = 4 ), parameter :: fftw_measure = 0
  integer ( kind = 4 ), parameter :: fftw_destroy_input = 1
  integer ( kind = 4 ), parameter :: fftw_unaligned = 2
  integer ( kind = 4 ), parameter :: fftw_conserve_memory = 4
  integer ( kind = 4 ), parameter :: fftw_exhaustive = 8
  integer ( kind = 4 ), parameter :: fftw_preserve_input = 16
  integer ( kind = 4 ), parameter :: fftw_patient = 32
  integer ( kind = 4 ), parameter :: fftw_estimate = 64
  integer ( kind = 4 ), parameter :: fftw_estimate_patient = 128
  integer ( kind = 4 ), parameter :: fftw_believe_pcost = 256
  integer ( kind = 4 ), parameter :: fftw_dft_r2hc_icky = 512
  integer ( kind = 4 ), parameter :: fftw_nonthreaded_icky = 1024
  integer ( kind = 4 ), parameter :: fftw_no_buffering = 2048
  integer ( kind = 4 ), parameter :: fftw_no_indirect_op = 4096
  integer ( kind = 4 ), parameter :: fftw_allow_large_generic = 8192
  integer ( kind = 4 ), parameter :: fftw_no_rank_splits = 16384
  integer ( kind = 4 ), parameter :: fftw_no_vrank_splits = 32768
  integer ( kind = 4 ), parameter :: fftw_no_vrecurse = 65536
  integer ( kind = 4 ), parameter :: fftw_no_simd = 131072
#+end_example

