fortran90/doc/readme.tex
\subsection{Example}
\label{sec:org6eb6ca4}
\begin{minted}[]{fortran}
integer :: n                  ! order of matrix A = JAC
integer :: lda = n            ! leading dimension of A
integer :: ipvt(n)            ! pivot indices
integer :: job = 0
real(rk) :: rcond
real(rk) :: z(n)
real(rk) :: jac(n,n)
!
! linear algebra routines (LINPACK) ----------------------------
!
call DGECO(jac, lda, n, ipvt, rcond, z)
! LU-factors JAC and estimates RCOND;
! JAC, on return, provides L and U
! IPVT is the pivot indices;
! Z is a work vector;
call DGESL(jac, n, n, ipvt, res, job)
! Solves JAC*X = RES; on return, RES is the solution;
! JOB = 0 for non-transposed problem
\end{minted}
\subsection{Notes}
\label{sec:orgb0a6848}
\begin{itemize}
\item When using Burkardt's \texttt{linpack\_d.f90}, make sure to link \texttt{lapack}
as it is not self-contained.
\begin{verbatim}
gfortran -o main.exe main.f90 linpack_d.f90 -framework Accelerate
\end{verbatim}
\item However, the quadruple precision library \texttt{linpack\_q.f90} is
self-contained:
\begin{verbatim}
gfortran -o main.exe main.f90 linpack_q.f90
\end{verbatim}
\item When using \texttt{linpack}, compile with either
\begin{itemize}
\item \href{file:///Users/tae/Dropbox/src/linpack.f}{linpack.f} (Fortran77)
\item \href{file:///Users/tae/Dropbox/src/linpack\_d.f90}{linpack\(_{\text{d.f90}}\)} (Fortran90) with \texttt{-framework Accelerate} flag.
\end{itemize}
Even if the main program follows Fortran90 standards, \texttt{linpack.f}
works seamlessly.
\item \textbf{Update} The source files \texttt{linpack*} are simply collection of
routines (dependencies) required for \texttt{DGECO}, \texttt{DGEDI}, and
\texttt{DGESL}. Some of them are again dependent on some routines of
\texttt{blas} library. The required routines are identified and combined
into a single source file for both \texttt{linpack} and \texttt{lapack}.
\end{itemize}

\section{LAPACK (modern)}
\label{sec:orgebc566e}
\subsection{Using LAPACK in Mac}
\label{sec:orgeed60b3}
Mac supplies a copy of LAPACK compiled and optimized for Apple hardwares
and it is easily available as a library. In order to link/load the
library, include \texttt{-framework Accelerate} compilation flag, e.g.,
\begin{minted}[]{shell}
gfortran -o myprog.exe myprog.f90 -framework Accelerate
\end{minted}

The library is located in the system directory \href{file:///System/Library/Frameworks/Accelerate.framework/}{/System/Library/Framework}.

\subsection{Useful subroutines and their usage}
\label{sec:orgf3d08d5}
Let \(A \in \mathbb{R}^{n \times n}\).
\begin{itemize}
\item DGETRF: LU-factorization of \(A\)
\item DGECON: calculates condition number of \(A\)
\item DGETRI: calculates the inverse \(A^{-1}\) using LU-decomposition
\item DGETRS: solves \(A x = b\) via Gaussian elimination, i.e. LU-factorization
\end{itemize}

\begin{minted}[]{fortran}
integer :: m                  ! number of rows
integer :: n                  ! number of columns
real(8) :: a(lda,n)           ! matrix A; on exit, factors L and U
integer :: lda                ! leading dimension of A
integer :: ipiv(n)            ! ivot indices, dimension = min(m,n)
integer :: info               ! 0 for successful exit
call dgetrf(m, n, a, lda, ipiv, info)
\end{minted}

\begin{minted}[]{fortran}
character*1 :: norm            ! '1' for 1-norm; 'I' for infinity-norm
integer :: n                   ! order of matrix
real(8) :: a(lda,n)            ! matrix/array A
integer :: lda                 ! leading dimension of A
real(8) :: anorm               ! 1-norm or infinity-norm of A; it is an input
real(8) :: rcond               ! rcond  = 1/(norm(A)norm(A^{-1}))
real(8) :: work(4*n)           ! double array
integer :: iwork(n)            ! integer array
integer :: info                ! 0 for successful exit
call dgecon(norm, n, a, lda, anorm, rcond, work, iwork, info)
\end{minted}

\begin{minted}[]{fortran}
character*1 :: trans        ! form of the S.O.E.; 'N' for no transpose
integer :: n                ! order of matrix A
integer :: nrhs             ! number of right-hand side
real(8) :: a(lda,n)         ! matrix A
integer :: lda              ! leading dimension of A
integer :: ipiv(n)          ! pivot indices
real(8) :: b(ldb,nrhs)      ! right-hand side; on exit, returns the solution X
integer :: ldb              ! leading dimension of A
integer :: info             ! 0 for successful exit
call dgetrs(trans, n, nrhs, a, lda, ipiv, b, ldb, info)
\end{minted}
\begin{itemize}
\item \textbf{Note.} One of the inputs, \texttt{anorm}, for \texttt{dgecon} must be calculated
before calling the routine. A function calculating matrix
infinity-norm has been included in my module, currently named as
\texttt{mnorm}.
\end{itemize}

\subsection{Example snippet}
\label{sec:org0669f4f}

\begin{minted}[]{fortran}
! for lapack routines
integer :: n
integer :: lda = n
integer :: ldb = n
integer :: lwork = 4*n
integer :: info
integer :: ipiv(n)
integer :: iwork(n)
real(rk) :: anorm
real(rk) :: rcond
real(rk) :: work(lwork)

! linear algebra routines (LAPACK) -------------------------------
anorm = mnorm(n, n, jac)   ! matrix infinity-norm
! calculating infinity norm of matrix JAC
call DGETRF(n, n, jac, lda, ipiv, info)
call DGECON('O', n, jac, lda, anorm, rcond, work, iwork, info)
call DGETRS('N', n, 1, jac, lda, ipiv, res, ldb, info)
\end{minted}

\section{FFTW}
\label{sec:orgbf523ec}
\subsection{Installation and basic usage}
\label{sec:org4ab39c8}
On Mac, I used \texttt{homebrew}
\begin{minted}[]{shell}
brew install fftw
\end{minted}

The files \texttt{libfftw3xxx.a} are saved in \href{file:///usr/local/lib/}{/usr/local/lib} directory. At link time, use \texttt{-l} flag as follows:
\begin{minted}[]{shell}
gfortran -o myprog.exe myprog.f90 -lfftw3
\end{minted}

The program file \texttt{myprog.f90} should contain a line
\begin{minted}[]{fortran}
include "fftw3.f90"
\end{minted}
which declares variables used.

On my linux machine running ArchLinux, I installed it using \texttt{packer}:
\begin{minted}[]{shell}
packer fftw fftw-quad
\end{minted}

\subsection{Variable declaration}
\label{sec:org77138c2}
The file \texttt{fftw3.f90} declares variables needed for execution of \texttt{fftw} routines:
\begin{minted}[]{shell}
cat ../src/fftw3.f90
\end{minted}
