fortran90/doc/readme.org
** Forward and backward 1-D (complex) DFT routines
The *forward DFT* of 1-D complex array $X$ of size $n$ calculates an
array $Y$ of the same dimension where
\[
Y_k = \sum_{j=0}^{n-1} X_j e^{-2\pi i j k / n} \,.
\]

The *backward DFT* computes
\[
Y_k = \sum_{j=0}^{n-1} X_j e^{2\pi i j k / n} \,.
\]

Note that =fftw= computes unnormalized transforms. So Fourier series
coefficients can be approximated using the forward DFT with $1/n$. The
inverse discrete Fourier transform is numerically calculated with the
backward DFT without any normalization.

Note also that an output of the forward DFT are ordered so that the
first half of the output corresponds to the positive modes while the
second half to the negative ones in backwards order; this is due to
the $n$-periodicity of $Y_k$ in its index.

*Example.* When $n = 8$, we have the following correspondence between indices ($k$), mode numbers, and Fortran indices:

    | k |    mode | fortran |
    |---+---------+---------|
    | 0 |       0 |       1 |
    | 1 |       1 |       2 |
    | 2 |       2 |       3 |
    | 3 |       3 |       4 |
    | 4 | Nyquist |       5 |
    | 5 |      -3 |       6 |
    | 6 |      -2 |       7 |
    | 7 |      -1 |       8 |

In general:
    | k     | mode    | fortran |
    |-------+---------+---------|
    | 0     | 0       | 1       |
    | 1     | 1       | 2       |
    | :     | :       | :       |
    | n/2-1 | n/2-1   | n/2     |
    | n/2   | Nyquist | n/2+1   |
    | n/2+1 | -n/2+1  | n/2+2   |
    | :     | :       | :       |
    | n-1   | -1      | n       |

*Snippet.*
#+BEGIN_SRC fortran
    implicit none
    include "fftw3.f90"
    integer ( kind = 4 ), parameter :: n = 100

    complex ( kind = 8 ) in(n)
    complex ( kind = 8 ) in2(n)
    complex ( kind = 8 ) out(n)
    integer ( kind = 8 ) plan_backward
    integer ( kind = 8 ) plan_forward
  !
  !  Make a plan for the FFT, and forward transform the data.
  !
    call dfftw_plan_dft_1d_ ( plan_forward, n, in, out, FFTW_FORWARD, FFTW_ESTIMATE )
    call dfftw_execute_ ( plan_forward )
    out = out/real(n, kind=8)     ! normalization
  !
  !  Make a plan for the backward FFT, and recover the original data.
  !
    call dfftw_plan_dft_1d_ ( plan_backward, n, out, in2, FFTW_BACKWARD, FFTW_ESTIMATE )
    call dfftw_execute_ ( plan_backward )
    print *, maxval(abs(in-in2))  ! compare the recovered data against the original
  !
  !  Discard the information associated with the plans.
  !
    call dfftw_destroy_plan_ ( plan_forward )
    call dfftw_destroy_plan_ ( plan_backward )
#+END_SRC

** Forward and backward 2-D (complex) DFT routines
The *forward DFT* of $n \times n$ 2-D complex array $X$ calculates an
array $Y \in \mathbb{C}^{n \times n}$ where
\[
Y_{j,k} = \sum_{m=0}^{n-1} \sum_{l=0}^{n-1} X_{l,m} e^{-2\pi i (jl+km)/n} \,.
\]

The *backward DFT* computes
\[
Y_{j,k} = \sum_{m=0}^{n-1} \sum_{l=0}^{n-1} X_{l,m} e^{2\pi i (jl+km)/n} \,.
\]

Note that these are simply the separable product of 1-D transforms
along each dimension of the array $X$, that is, along the columns and
rows of $X$.

Once again, =fftw= computes unnormalized transforms and so double
Fourier series coefficients can be approximated using the forward DFT
with $1/n^2$. The inverse discrete Fourier transform is numerically
calculated with the backward DFT without any normalization.

*Snippet*
#+BEGIN_SRC fortran
    implicit none
    include "fftw3.f90"
    integer ( kind = 4 ), parameter :: n = 100
    integer ( kind = 4 ) :: i, j
    complex ( kind = 8 ) :: in(n)
    complex ( kind = 8 ) :: in2(n,n)
    complex ( kind = 8 ) :: out(n)
    complex ( kind = 8 ) :: out2(n,n)
    complex ( kind = 8 ) :: X(n,n)
    complex ( kind = 8 ) :: Y(n,n)
    integer ( kind = 8 ) :: plan_backward
    integer ( kind = 8 ) :: plan_forward

    ! Method 1: double 1d-fft's
    do j = 1,n                    ! along columns
       in = X(:, j)
       call dfftw_plan_dft_1d_ &
            ( plan_forward, n, in, out, FFTW_FORWARD, FFTW_ESTIMATE)
       call dfftw_execute_ ( plan_forward )
        X(:, j) = out/real(n, rk)
    end do
    do i = 1,n                    ! then along rows
       in = X(i, :)
       call dfftw_plan_dft_1d_ &
            ( plan_forward, n, in, out, FFTW_FORWARD, FFTW_ESTIMATE)
       call dfftw_execute_ ( plan_forward )
       Y(i, :) = out/real(n, rk)
    end do
    call dfftw_destroy_plan_ ( plan_forward )

    ! Method 2: 2d-fft
    in2 = X
    call dfftw_plan_dft_2d_ ( plan_forward, n, n, in2, out2, FFTW_FORWARD, &
         FFTW_ESTIMATE)
    call dfftw_execute_ ( plan_forward )
    Y = out2/real(n**2, rk)
    call dfftw_destroy_plan_ ( plan_forward )
#+END_SRC

** Shifted FFT
Using the approximating nature of DFT on physical data against the coefficients of Fourier expansion, we may utilize FFT routines on data obtained on half-step shifted grids on $[0, 2\pi)$.

For the sake of illustration, consider the 1-D FFT situation where $X^{(s)} \in \mathbb{C}^{N}$ is a vector of point values at $2\pi(j+1/2)/N$ for $0 \le j < N$ and $Y^{(s)}$ is the result of the forward FFT on $X^{(s)}$, i.e.,
\[
Y^{(s)}_j = \frac{1}{N} \sum_{k=0}^{N-1} X^{(s)}_k e^{-2 \pi i j k /N} \,.
\]

By adjusting the phase of complex exponentials, we can interpret them in term of approximate Fourier coefficients of the underlying function for the $X^{(s)}$ data. Keeping in mind the aliasing errors associated with the discrete Fourier transforms, i.e., the $N$-periodicity over the index $j$, we observe that

 - For $0 \le j < N/2$,
   \[
   Y^{(s)}_j \approx Y_j e^{- i j/N} \,,
   \]
 - For $N/2 < j < N$,
   \[
   Y^{(s)}_j \approx Y_j e^{- i (j-N)/N} \,,
   \]

The second case was considered with
* Compiling with =gfortran=
* Makefile
** Editing a make file in Emacs/Org-mode
 - When a =make= source code written in org-mode src block is tangled,
   tabs are converted to spaces. One can manually =M-x tabify= the
   entire file.
 - A makefile whose file name is not =Makefile= will not be in =makefile-mode= automatically. Set the mode by =M-x makefile-mode=.
 - In order to run a makefile with filename other than =Makefile=, use =make -f filename=.

** Some idea from StackOverflow
From [[https://stackoverflow.com/questions/8855896/specify-directory-where-gfortran-should-look-for-modules][Specify directory where gfortran should look for modules]]

#+BEGIN_EXAMPLE
  You can tell gfortran where your module files (.mod files) are located with the -I compiler flag. In addition, you can tell the compiler where to put compiled modules with the -J compiler flag. See the section "Options for directory search" in the gfortran man page.

  I use these to place both my object (.o files) and my module files in the same directory, but in a different directory to all my source files, so I don't clutter up my source directory. For example,

  SRC = /path/to/project/src
  OBJ = /path/to/project/obj
  BIN = /path/to/project/bin

  gfortran -J$(OBJ) -c $(SRC)/bar.f90 -o $(OBJ)/bar.o
  gfortran -I$(OBJ) -c $(SRC)/foo.f90 -o $(OBJ)/foo.o
  gfortran -o $(BIN)/foo.exe $(OBJ)/foo.o $(OBJ)/bar.o
  While the above looks like a lot of effort to type out on the command line, I generally use this idea in my makefiles.

  Just for reference, the equivalent Intel fortran compiler flags are -I and -module. Essentially ifort replaces the -J option with -module. Note that there is a space after module, but not after J.
#+END_EXAMPLE

* Fortran 90 programming tips
