fortran90/doc/readme.org
** Notes on precision in fortran90+
At the beginning of program, set real precision, which is of integer type, to be
- 4 : single
- 8 : double
- 16 : quadruple
For example, declare
#+BEGIN_SRC fortran
  integer, parameter :: rp = 16
#+END_SRC

Then the precision of a real or complex variable can be declared by:
#+BEGIN_SRC fortran
  real(kind=rp) :: x
  complex(kind=rp) :: z
#+END_SRC
or simply by
#+BEGIN_SRC fortran
  real(rp) :: x
  complex(rp) :: z
#+END_SRC

In the body of program, the precision of a floating point number can be set by suffixing with the precision parameter, e.g.
- 1.0_4 : single, same as 1.0
- 1.0_8 : double, same as 1.d0
- 1.0_16 : quadruple
Once the precision is stored in the variable, say  =rp=, one can simply write =1.0_rp=.

The precision of outputs of an intrinsic function is determined by that of its input(s). This way, we can avoid using old =d=-variations, e.g., =dcos=, =dsin=, =dabs=, etc.

A complex number of certain precision can be constructed using =cmplx= function with the following syntax:
#+BEGIN_SRC fortran
  z = cmplx( x, y, rp )
#+END_SRC

** Tip on =write= function: internal writing

The following is an example of using =write= function to assimilate the functionality of =MatLab='s =sprintf=.

#+BEGIN_SRC fortran :tangle scratch.f90
  program play
    implicit none
    integer :: m
    real(8) :: rho

    interface
       function genfilename(n, rho, betaopt)
         integer, intent(in) :: n
         real(8), intent(in) :: rho
         integer, intent(in) :: betaopt
       end function genfilename
    end interface

  end program play

  function genfilename(n, rho, betaopt)
    implicit none
    ! declaring arguments
    integer, intent(in) :: n
    real(8), intent(in) :: rho
    integer, intent(in) :: betaopt
    ! output
    character(len=28) :: genfilename
    ! local variables
    character(len=*), parameter :: fmt = trim('(a, i1, a, i0.2, a, i0.4, a)')
    integer :: log2n
    log2n = int(log(real(n))/log(real(2)))
    write( genfilename, fmt ) &
         '../data/vp_b', betaopt, '_n', log2n, '_r', int(1000*rho), '.dat'
  end function genfilename
#+END_SRC

#+RESULTS:
: ./data/vp_b0_n05_r0123.dat

** =linspaceh= function:
The function =linspaceh(a, b, h)= constructs a vector of uniformly spaced-out points between =a= and =b= with gap =h=. In case =b-a= is not a (numerical) multiple of =h=, then the gap between =b= and the one before will be smaller than =h=. This function is included in [[file:~/Google%20Drive/VP_fortran/src/mymod.f90][mymod.f90]].

#+BEGIN_SRC fortran :results value verbatim
  program main
    implicit none
    real(8) :: rho0
    real(8) :: rho1
    real(8) :: drho
    real(8), dimension(:), allocatable :: rhodpt
    integer :: i

    interface
       function linspaceh(a, b, h)
         real(8), intent(in) :: a, b, h
         real(8), dimension(:), allocatable :: linspaceh
       end function linspaceh
    end interface
    rho0 = 0.1D0
    rho1 = 0.53D0
    drho = 0.05D0
    rhodpt = linspaceh(rho0, rho1, drho)
    do i = 1, size(rhodpt)
       write(*, '(i3, 2x, f6.4)') i, rhodpt(i)
    end do
    print *, rhodpt, "hello world"
    deallocate (rhodpt)
  end program main

  function linspaceh(a, b, h)
    implicit none
    real(8), intent(in) :: a, b, h
    real(8), parameter :: eps = epsilon(1.d0)
    integer :: i, n
    real(8), dimension(:), allocatable :: linspaceh
    n = int((b-a)/h)
    ! if (abs((b-a)/h-n)<eps) then  -----------> it doesn't work
    ! if ( abs( (b-a)-n*h ) < eps ) then ------> this works
    if ( abs(mod(b-a, h)) < eps ) then ! note we compare against the
       ! machine epsilo n
       allocate(linspaceh(n+1))
       linspaceh = (/ (a + h*i, i=0,n) /)
    else
       allocate(linspaceh(n+2))
       linspaceh = (/ (a+h*i, i=0,n), b /) ! note how a vector and a
                                           ! number are concatenated
    end if
  end function linspaceh
#+END_SRC

#+RESULTS:
#+begin_example
1  0.1000
 2  0.1500
 3  0.2000
 4  0.2500
 5  0.3000
 6  0.3500
 7  0.4000
 8  0.4500
 9  0.5000
10  0.5300
 0.10000000000000001       0.15000000000000002       0.20000000000000001       0.25000000000000000       0.30000000000000004       0.34999999999999998       0.40000000000000002       0.45000000000000007       0.50000000000000000       0.53000000000000003      hello world
#+end_example

** I/O formatting
*** =print=
Printing out to terminal: =print format_specifier, i/o_list=,
e.g. =print *, 'hello world'=
*** =write=
#+BEGIN_SRC fortran :results verbatim
    implicit none
    real(8) :: pi = acos(-1.0d0)
    integer :: n = 256
    integer :: i
    write(*, '( i30   )') n          ! integer
    write(*, *) pi                   ! free format
    write(*, '( f30.16)') pi         ! decimal
    write(*, '( g30.16)') pi         ! whichever is nice
    write(*, '( e30.16)') pi         ! exponential notation
    write(*, '(es30.16)') pi         ! scientific notation
    write(*, '(en30.16)') pi         ! engineering notation
    write(*, '( e30.16E3)') pi       ! exponential notation, more spaces for exponents
    write(*, '(2e30.16)') pi, 2*pi   ! concatenation of two
    write(*, '(*(f7.2))') (/ (i*pi, i=1,5) /) ! variable number of outputs
#+END_SRC

#+RESULTS:
#+begin_example
256
3.1415926535897931
         3.1415926535897931
      3.141592653589793
     0.3141592653589793E+01
     3.1415926535897931E+00
     3.1415926535897931E+00
    0.3141592653589793E+001
     0.3141592653589793E+01        0.6283185307179586E+01
3.14   6.28   9.42  12.57  15.71
#+end_example

** Arrays - basics
 - In Fortran 90+, one can construct arrays with inline do-loops, a.k.a., implied do-loops. For example,
   #+BEGIN_SRC fortran
       v = (/ (i, i=1,10) /)
       w = [ (j, j=1,100,2) ]
   #+END_SRC

 - Of course, =i= and =j= need to be declared integers and =v= and =w=
   as integer/real/complex arrays of appropriate dimensions. Note
   below how types are cast:
   #+BEGIN_SRC fortran :tangle arrays.f90
     program arrays
       implicit none
       integer, parameter :: m=2, n=5
       integer :: i
       integer :: v_int(n), inner, outer(n,n)
       real :: v_real(n), a(m,n), a1(m,n), b(n,m), b1(n,m), c(m,m), d(n,n)
       complex :: v_cmplx(n)

       ! constructing vectors using inline do-loops
       v_int = [ (i, i = 1,n) ]
       v_real = [ (i, i = 1,n) ]
       v_cmplx = [ (cmplx(i, sqrt(real(i))), i = 1,n) ]

       ! type-casting
       do i = 1,n
          print *, v_int(i), v_real(i), v_cmplx(i)
       end do

       ! 2-D array using do-loop
       do i = 1,n
          a(1:m,i) = (/ i, i+1 /)
       end do

       ! 2-D array using reshape and implied do-loop
       a1 = reshape( [(i, i=1,m*n)], [m,n] )

       ! transpose
       b = transpose(a)

       ! reshaping
       b1 = reshape( a1, [n,m] )

       ! scalar multiplication, inner product, outer product
       v_int = 2*v_int               ! scalar multiplication
       inner = dot_product(v_int, v_int) ! inner product
       outer = spread(v_int, 2, n)*spread(v_int, 1, n)
       ! spread behaves like MatLab's repmat function

       print *, ''
       do i = 1,n
          print *, v_int(i)
       end do
     end program arrays
   #+END_SRC

 - =size= and =shape=
   #+BEGIN_SRC fortran
       implicit none
       integer :: a(3,5), i
       a = reshape( (/(i, i=1,15)/), (/3,5/) )
       print *, size(a)
       print *, size(a, 1)
       print *, size(a, 2)
   #+END_SRC

   #+RESULTS:
   | 15 |
   |  3 |
   |  5 |

