fortran90/doc/readme.tex
\subsection{Notes on precision in fortran90+}
\label{sec:orgbb99309}
At the beginning of program, set real precision, which is of integer type, to be
\begin{itemize}
\item 4 : single
\item 8 : double
\item 16 : quadruple
\end{itemize}
For example, declare
\begin{minted}[]{fortran}
integer, parameter :: rp = 16
\end{minted}

Then the precision of a real or complex variable can be declared by:
\begin{minted}[]{fortran}
real(kind=rp) :: x
complex(kind=rp) :: z
\end{minted}
or simply by
\begin{minted}[]{fortran}
real(rp) :: x
complex(rp) :: z
\end{minted}

In the body of program, the precision of a floating point number can be set by suffixing with the precision parameter, e.g.
\begin{itemize}
\item 1.0\(_{\text{4}}\) : single, same as 1.0
\item 1.0\(_{\text{8}}\) : double, same as 1.d0
\item 1.0\(_{\text{16}}\) : quadruple
\end{itemize}
Once the precision is stored in the variable, say  \texttt{rp}, one can simply write \texttt{1.0\_rp}.

The precision of outputs of an intrinsic function is determined by that of its input(s). This way, we can avoid using old \texttt{d}-variations, e.g., \texttt{dcos}, \texttt{dsin}, \texttt{dabs}, etc.

A complex number of certain precision can be constructed using \texttt{cmplx} function with the following syntax:
\begin{minted}[]{fortran}
z = cmplx( x, y, rp )
\end{minted}

\subsection{Nice tips on using \texttt{read} and \texttt{write} functions}
\label{sec:org014bb6d}

The following is an example of using \texttt{write} function to assimilate the functionality of \texttt{MatLab}'s \texttt{sprintf}.

\begin{minted}[]{fortran}
program play
  implicit none
  integer :: m
  real(8) :: rho

  interface
     function genfilename(n, rho, betaopt)
       integer, intent(in) :: n
       real(8), intent(in) :: rho
       integer, intent(in) :: betaopt
     end function genfilename
  end interface

end program play

function genfilename(n, rho, betaopt)
  implicit none
  ! declaring arguments
  integer, intent(in) :: n
  real(8), intent(in) :: rho
  integer, intent(in) :: betaopt
  ! output
  character(len=28) :: genfilename
  ! local variables
  character(len=*), parameter :: fmt = trim('(a, i1, a, i0.2, a, i0.4, a)')
  integer :: log2n
  log2n = int(log(real(n))/log(real(2)))
  write( genfilename, fmt ) &
       '../data/vp_b', betaopt, '_n', log2n, '_r', int(1000*rho), '.dat'
end function genfilename
\end{minted}

\subsection{\texttt{linspaceh} function:}
\label{sec:orgf4426f7}
The function \texttt{linspaceh(a, b, h)} constructs a vector of uniformly spaced-out points between \texttt{a} and \texttt{b} with gap \texttt{h}. In case \texttt{b-a} is not a (numerical) multiple of \texttt{h}, then the gap between \texttt{b} and the one before will be smaller than \texttt{h}. This function is included in \href{file:///Users/tae/Google\%20Drive/VP\_fortran/src/mymod.f90}{mymod.f90}.

\begin{minted}[]{fortran}
program main
  implicit none
  real(8) :: rho0
  real(8) :: rho1
  real(8) :: drho
  real(8), dimension(:), allocatable :: rhodpt
  integer :: i

  interface
     function linspaceh(a, b, h)
       real(8), intent(in) :: a, b, h
       real(8), dimension(:), allocatable :: linspaceh
     end function linspaceh
  end interface
  rho0 = 0.1D0
  rho1 = 0.53D0
  drho = 0.05D0
  rhodpt = linspaceh(rho0, rho1, drho)
  do i = 1, size(rhodpt)
     write(*, '(i3, 2x, f6.4)') i, rhodpt(i)
  end do
  print *, rhodpt, "hello world"
  deallocate (rhodpt)
end program main

function linspaceh(a, b, h)
  implicit none
  real(8), intent(in) :: a, b, h
  real(8), parameter :: eps = epsilon(1.d0)
  integer :: i, n
  real(8), dimension(:), allocatable :: linspaceh
  n = int((b-a)/h)
  ! if (abs((b-a)/h-n)<eps) then  -----------> it doesn't work
  ! if ( abs( (b-a)-n*h ) < eps ) then ------> this works
  if ( abs(mod(b-a, h)) < eps ) then ! note we compare against the
     ! machine epsilo n
     allocate(linspaceh(n+1))
     linspaceh = (/ (a + h*i, i=0,n) /)
  else
     allocate(linspaceh(n+2))
     linspaceh = (/ (a+h*i, i=0,n), b /) ! note how a vector and a
                                         ! number are concatenated
  end if
end function linspaceh
\end{minted}

\subsection{I/O formatting}
\label{sec:org9cdbc28}
\subsubsection{\texttt{print}}
\label{sec:orgbc969e9}
Printing out to terminal: \texttt{print format\_specifier, i/o\_list},
e.g. \texttt{print *, 'hello world'}
\subsubsection{\texttt{write}}
\label{sec:org98ef15c}
\begin{minted}[]{fortran}
implicit none
real(8) :: pi = acos(-1.0d0)
integer :: n = 256
write(*, '( i30   )') n          ! integer
write(*, *) pi                   ! free format
write(*, '( f30.16)') pi         ! decimal
write(*, '( g30.16)') pi         ! whichever is nice
write(*, '( e30.16)') pi         ! exponential notation
write(*, '(es30.16)') pi         ! scientific notation
write(*, '(en30.16)') pi         ! engineering notation
write(*, '( e30.16E3)') pi       ! exponential notation, more spaces for exponents
write(*, '(2e30.16)') pi, 2*pi   ! concatenation of two
\end{minted}

\subsection{Arrays - basics}
\label{sec:org36ec673}
\begin{itemize}
\item In Fortran 90+, one can construct arrays with inline do-loops, a.k.a., implied do-loops. For example,
\begin{minted}[]{fortran}
v = (/ (i, i=1,10) /)
w = [ (j, j=1,100,2) ]
\end{minted}

\item Of course, \texttt{i} and \texttt{j} need to be declared integers and \texttt{v} and \texttt{w}
as integer/real/complex arrays of appropriate dimensions. Note
below how types are cast:
\begin{minted}[]{fortran}
program arrays
  implicit none
  integer, parameter :: m=2, n=5
  integer :: i
  integer :: v_int(n), inner, outer(n,n)
  real :: v_real(n), a(m,n), a1(m,n), b(n,m), b1(n,m), c(m,m), d(n,n)
  complex :: v_cmplx(n)

  ! constructing vectors using inline do-loops
  v_int = [ (i, i = 1,n) ]
  v_real = [ (i, i = 1,n) ]
  v_cmplx = [ (cmplx(i, sqrt(real(i))), i = 1,n) ]

  ! type-casting
  do i = 1,n
     print *, v_int(i), v_real(i), v_cmplx(i)
  end do

  ! 2-D array using do-loop
  do i = 1,n
     a(1:m,i) = (/ i, i+1 /)
  end do

  ! 2-D array using reshape and implied do-loop
  a1 = reshape( [(i, i=1,m*n)], [m,n] )

  ! transpose
  b = transpose(a)

  ! reshaping
  b1 = reshape( a1, [n,m] )

  ! scalar multiplication, inner product, outer product
  v_int = 2*v_int               ! scalar multiplication
  inner = dot_product(v_int, v_int) ! inner product
  outer = spread(v_int, 2, n)*spread(v_int, 1, n)
  ! spread behaves like MatLab's repmat function

  print *, ''
  do i = 1,n
     print *, v_int(i)
  end do
end program arrays
\end{minted}

\item \texttt{size} and \texttt{shape}
\end{itemize}
