fortran90/doc/readme.org
** Arrays - assignment
Many functions on arrays behave similarly to those of =MatLa=.

#+BEGIN_SRC fortran :results verbatim
  implicit none
  integer, parameter :: n = 5
  integer, parameter :: rk = 8
  integer :: i
  real(rk) :: v(n), w(n), A(n,n)

  A = 0.0_rk                    ! creating zero matrix
  write(*, '(a)') 'Creating zero matrix'
  write(*, '(a/)') 'A = 0.0_rk  yields '
  write(*, '(5f8.4)') A

  v = (/ (i, i=1,n) /)
  w = (/ (i, i=n,1,-1) /)
  write(*, '(/a)') 'Defining vectors'
  write(*, '(5f8.4)') v
  write(*, '(5f8.4)') w

  write(*, '(/a)') 'Assigning columns of A:'
  do i = 1,n
     A(:,i) = v**i
  end do
  do i = 1,n
     write(*, '(5g12.4)') A(i, :)
  end do
#+END_SRC

#+RESULTS:
#+begin_example
Creating zero matrix
A = 0.0_rk  yields

  0.0000  0.0000  0.0000  0.0000  0.0000
  0.0000  0.0000  0.0000  0.0000  0.0000
  0.0000  0.0000  0.0000  0.0000  0.0000
  0.0000  0.0000  0.0000  0.0000  0.0000
  0.0000  0.0000  0.0000  0.0000  0.0000

Defining vectors
  1.0000  2.0000  3.0000  4.0000  5.0000
  5.0000  4.0000  3.0000  2.0000  1.0000

Assigning columns of A:
   1.000       1.000       1.000       1.000       1.000
   2.000       4.000       8.000       16.00       32.00
   3.000       9.000       27.00       81.00       243.0
   4.000       16.00       64.00       256.0       1024.
   5.000       25.00       125.0       625.0       3125.
#+end_example

** Arrays: =transpose= and =spread=
#+BEGIN_SRC fortran :results verbatim
  implicit none
  integer, parameter :: n = 5
  integer, parameter :: rk = 8
  integer :: i
  real(rk) :: v(n), w(n), A(n,n), B(n,n)

  v = (/ (i, i=1,n) /)
  w = (/ (i, i=n,1,-1) /)
  write(*, '(/a)') 'Defining vectors'
  write(*, '(5f8.4)') v
  write(*, '(5f8.4)') w

  write(*, '(/a)') 'spread: equivalent of repmat in matlab'
  write(*, '(a)') '   syntax: spread( array, dim, ncopies )'
  A = spread(v, 1, n)
  B = spread(v, 2, n)

  write(*, '(/a)') '  A = '
  do i = 1,n
     write(*, '(5g12.4)') A(i, :)
  end do

  write(*, '(/a)') '  B = '
  do i = 1,n
     write(*, '(5g12.4)') B(i, :)
  end do

  B = transpose(A)
  write(*, '(/a)') 'Transpose of a matrix'
  write(*, '(a)') '    syntax: transpose( array )'
  write(*, '(/a)') '  A transpoe = '
  do i = 1,n
     write(*, '(5g12.4)') B(i, :)
  end do
#+END_SRC

#+RESULTS:
#+begin_example
Defining vectors
  1.0000  2.0000  3.0000  4.0000  5.0000
  5.0000  4.0000  3.0000  2.0000  1.0000

spread: equivalent of repmat in matlab
   syntax: spread( array, dim, ncopies )

  A =
   1.000       2.000       3.000       4.000       5.000
   1.000       2.000       3.000       4.000       5.000
   1.000       2.000       3.000       4.000       5.000
   1.000       2.000       3.000       4.000       5.000
   1.000       2.000       3.000       4.000       5.000

  B =
   1.000       1.000       1.000       1.000       1.000
   2.000       2.000       2.000       2.000       2.000
   3.000       3.000       3.000       3.000       3.000
   4.000       4.000       4.000       4.000       4.000
   5.000       5.000       5.000       5.000       5.000

Transpose of a matrix
    syntax: transpose( array )

  A transpoe =
   1.000       1.000       1.000       1.000       1.000
   2.000       2.000       2.000       2.000       2.000
   3.000       3.000       3.000       3.000       3.000
   4.000       4.000       4.000       4.000       4.000
   5.000       5.000       5.000       5.000       5.000
#+end_example

** Arrays: general concatenation using =reshape=
#+BEGIN_SRC fortran :results verbatim
  implicit none
  integer, parameter :: n = 5
  integer, parameter :: rk = 8
  integer :: i
  real(rk) :: v(n), w(n), A(n,n), B(n,n), C(2*n,n), D(n,2*n)

  v = (/ (i, i=1,n) /)
  w = (/ (i, i=n,1,-1) /)

  A =  reshape((/ (v**i, i=1,n) /), [n,n])
  write(*, '(/a)') 'Concatenation using reshape function'
  do i = 1,n
     write(*, '(5g12.4)') A(i, :)
  end do

  B =  transpose(reshape((/ (v**i, i=1,n) /), [n,n]))
  write(*, '(/a)') 'Concatenation using reshape function'
  do i = 1,n
     write(*, '(5g12.4)') B(i, :)
  end do

  C(1:n, :) = A
  C(n+1:2*n, :) = B(n:1:-1, :)
  write(*, '(/a)') 'Concatenating two matrices'
  do i = 1,2*n
     write(*, '(5g12.4)') C(i, :)
  end do
#+END_SRC

#+RESULTS:
#+begin_example
Concatenation using reshape function
   1.000       1.000       1.000       1.000       1.000
   2.000       4.000       8.000       16.00       32.00
   3.000       9.000       27.00       81.00       243.0
   4.000       16.00       64.00       256.0       1024.
   5.000       25.00       125.0       625.0       3125.

Concatenation using reshape function
   1.000       2.000       3.000       4.000       5.000
   1.000       4.000       9.000       16.00       25.00
   1.000       8.000       27.00       64.00       125.0
   1.000       16.00       81.00       256.0       625.0
   1.000       32.00       243.0       1024.       3125.

Concatenating two matrices
   1.000       1.000       1.000       1.000       1.000
   2.000       4.000       8.000       16.00       32.00
   3.000       9.000       27.00       81.00       243.0
   4.000       16.00       64.00       256.0       1024.
   5.000       25.00       125.0       625.0       3125.
   1.000       32.00       243.0       1024.       3125.
   1.000       16.00       81.00       256.0       625.0
   1.000       8.000       27.00       64.00       125.0
   1.000       4.000       9.000       16.00       25.00
   1.000       2.000       3.000       4.000       5.000
#+end_example

** Arrays: trick to calculate maximal value of an array using =reshape=
#+BEGIN_SRC fortran :results verbatim
  implicit none
  real(8) :: a(3,3)

  a(1,1) = 1.0D+00
  a(1,2) = 2.0D+00
  a(1,3) = 3.0D+00

  a(2,1) = 4.0D+00
  a(2,2) = 5.0D+00
  a(2,3) = 6.0D+00

  a(3,1) = 7.0D+00
  a(3,2) = 8.0D+00
  a(3,3) = 0.0D+00

  print *, maxval( reshape(a, [size(a)]) ) ! turn a into a vector
  ! the 2nd arg of reshape should be an array of rank 1
#+END_SRC

#+RESULTS:
: 8.0

** Arrays: indexation
#+BEGIN_SRC fortran
    implicit none
    integer :: a(5,5), i
    a = reshape( (/(i, i=1,25)/), (/5,5/) )
    write(*, '(i5)') a
    do i = 1,5
       write(*, '(*(i5))') a(i,:)
    end do
#+END_SRC

#+RESULTS:
|  1 |    |    |    |    |
|  2 |    |    |    |    |
|  3 |    |    |    |    |
|  4 |    |    |    |    |
|  5 |    |    |    |    |
|  6 |    |    |    |    |
|  7 |    |    |    |    |
|  8 |    |    |    |    |
|  9 |    |    |    |    |
| 10 |    |    |    |    |
| 11 |    |    |    |    |
| 12 |    |    |    |    |
| 13 |    |    |    |    |
| 14 |    |    |    |    |
| 15 |    |    |    |    |
| 16 |    |    |    |    |
| 17 |    |    |    |    |
| 18 |    |    |    |    |
| 19 |    |    |    |    |
| 20 |    |    |    |    |
| 21 |    |    |    |    |
| 22 |    |    |    |    |
| 23 |    |    |    |    |
| 24 |    |    |    |    |
| 25 |    |    |    |    |
|  1 |  6 | 11 | 16 | 21 |
|  2 |  7 | 12 | 17 | 22 |
|  3 |  8 | 13 | 18 | 23 |
|  4 |  9 | 14 | 19 | 24 |
|  5 | 10 | 15 | 20 | 25 |

** Arrays: =lbound= and =ubound=
#+BEGIN_SRC fortran
    implicit none
    integer :: v(1:10), w(-5:4)
    print *, lbound(v), ubound(v)
    print *, lbound(w), ubound(w)
#+END_SRC

#+RESULTS:
|  1 | 10 |
| -5 |  4 |

** Characters
*** Example
#+BEGIN_SRC fortran
  program character
    implicit none
    character(len=30) :: fname

    fname = 'mydata.dat'
    print *, fname
    stop
  end program character
#+END_SRC

#+RESULTS:
: mydata.dat
*** Notes
 - Use =character(len=*)= when the length of a character string is not known.
** Important notes on =interface=
When one intends to input an array of arbitrary size into a routine, the /assumed shape/ technique turns out to be quite advantageous. Consider the following sample program:

#+BEGIN_SRC fortran
  program dummy_array
    implicit none
    integer, dimension(10) :: a
    interface ! This interface block is necessary
       subroutine fill_array(a)
         integer, dimension(:), intent(out) :: a
       end subroutine fill_array
    end interface
    call fill_array(a)
    write(*, '(i4)') a
  end program dummy_array

  subroutine fill_array(a)
    implicit none
    ! argument declaration
    integer, dimension(:), intent(out) :: a
    ! local variable
    integer :: i, size_a
    size_a = size(a)
    do i = 1,size_a
       a(i) = i
    end do
  end subroutine fill_array
#+END_SRC

#+RESULTS:
|  1 |
|  2 |
|  3 |
|  4 |
|  5 |
|  6 |
|  7 |
|  8 |
|  9 |
| 10 |

Note that the =interface= block is required. In the block, only the arguments to the routines need be type-cast.

In order to avoid writing such blocks over and over, utilize a module structure as follows:
#+BEGIN_SRC fortran
  module mod
  contains
    subroutine fill_array(a)
      implicit none
      ! argument declaration
      integer, dimension(:), intent(out) :: a
      ! local variable
      integer :: i, size_a
      size_a = size(a)
      do i = 1,size_a
         a(i) = i
      end do
    end subroutine fill_array
  end module mod

  program dummy_array
    use mod
    implicit none
    integer, dimension(10) :: a
    call fill_array(a)
    write(*, '(i4)') a
  end program dummy_array
#+END_SRC

#+RESULTS:
|  1 |
|  2 |
|  3 |
|  4 |
|  5 |
|  6 |
|  7 |
|  8 |
|  9 |
| 10 |

