fortran90/doc/readme.tex
\subsection{Arrays - assignment}
\label{sec:org7b8765f}
Many functions on arrays behave similarly to those of \texttt{MatLa}.

\begin{minted}[]{fortran}
implicit none
integer, parameter :: n = 5
integer, parameter :: rk = 8
integer :: i
real(rk) :: v(n), w(n), A(n,n)

A = 0.0_rk                    ! creating zero matrix
write(*, '(a)') 'Creating zero matrix'
write(*, '(a/)') 'A = 0.0_rk  yields '
write(*, '(5f8.4)') A

v = (/ (i, i=1,n) /)
w = (/ (i, i=n,1,-1) /)
write(*, '(/a)') 'Defining vectors'
write(*, '(5f8.4)') v
write(*, '(5f8.4)') w

write(*, '(/a)') 'Assigning columns of A:'
do i = 1,n
   A(:,i) = v**i
end do
do i = 1,n
   write(*, '(5g12.4)') A(i, :)
end do
\end{minted}

\subsection{Arrays: \texttt{transpose} and \texttt{spread}}
\label{sec:org2ace33d}
\begin{minted}[]{fortran}
implicit none
integer, parameter :: n = 5
integer, parameter :: rk = 8
integer :: i
real(rk) :: v(n), w(n), A(n,n), B(n,n)

v = (/ (i, i=1,n) /)
w = (/ (i, i=n,1,-1) /)
write(*, '(/a)') 'Defining vectors'
write(*, '(5f8.4)') v
write(*, '(5f8.4)') w

write(*, '(/a)') 'spread: equivalent of repmat in matlab'
write(*, '(a)') '   syntax: spread( array, dim, ncopies )'
A = spread(v, 1, n)
B = spread(v, 2, n)

write(*, '(/a)') '  A = '
do i = 1,n
   write(*, '(5g12.4)') A(i, :)
end do

write(*, '(/a)') '  B = '
do i = 1,n
   write(*, '(5g12.4)') B(i, :)
end do

B = transpose(A)
write(*, '(/a)') 'Transpose of a matrix'
write(*, '(a)') '    syntax: transpose( array )'
write(*, '(/a)') '  A transpoe = '
do i = 1,n
   write(*, '(5g12.4)') B(i, :)
end do
\end{minted}

\subsection{Arrays: general concatenation using \texttt{reshape}}
\label{sec:org198c7d8}
\begin{minted}[]{fortran}
implicit none
integer, parameter :: n = 5
integer, parameter :: rk = 8
integer :: i
real(rk) :: v(n), w(n), A(n,n), B(n,n), C(2*n,n), D(n,2*n)

v = (/ (i, i=1,n) /)
w = (/ (i, i=n,1,-1) /)

A =  reshape((/ (v**i, i=1,n) /), [n,n])
write(*, '(/a)') 'Concatenation using reshape function'
do i = 1,n
   write(*, '(5g12.4)') A(i, :)
end do

B =  transpose(reshape((/ (v**i, i=1,n) /), [n,n]))
write(*, '(/a)') 'Concatenation using reshape function'
do i = 1,n
   write(*, '(5g12.4)') B(i, :)
end do

C(1:n, :) = A
C(n+1:2*n, :) = B(n:1:-1, :)
write(*, '(/a)') 'Concatenating two matrices'
do i = 1,2*n
   write(*, '(5g12.4)') C(i, :)
end do
\end{minted}

\subsection{Arrays: trick to calculate maximal value of an array using \texttt{reshape}}
\label{sec:orgc1f2cdc}
\begin{minted}[]{fortran}
implicit none
real(8) :: a(3,3)

a(1,1) = 1.0D+00
a(1,2) = 2.0D+00
a(1,3) = 3.0D+00

a(2,1) = 4.0D+00
a(2,2) = 5.0D+00
a(2,3) = 6.0D+00

a(3,1) = 7.0D+00
a(3,2) = 8.0D+00
a(3,3) = 0.0D+00

print *, maxval( reshape(a, [size(a)]) ) ! turn a into a vector
! the 2nd arg of reshape should be an array of rank 1
\end{minted}

\subsection{Characters}
\label{sec:org2db8d92}
\subsubsection{Example}
\label{sec:orgbbc7a5a}
\begin{minted}[]{fortran}
program character
  implicit none
  character(len=30) :: fname

  fname = 'mydata.dat'
  print *, fname
  stop
end program character
\end{minted}
\subsubsection{Notes}
\label{sec:orgbc35629}
\begin{itemize}
\item Use \texttt{character(len=*)} when the length of a character string is not known.
\end{itemize}
\subsection{Important notes on \texttt{interface}}
\label{sec:orgf599c6c}
When one intends to input an array of arbitrary size into a routine, the \emph{assumed shape} technique turns out to be quite advantageous. Consider the following sample program:

\begin{minted}[]{fortran}
program dummy_array
  implicit none
  integer, dimension(10) :: a
  interface ! This interface block is necessary
     subroutine fill_array(a)
       integer, dimension(:), intent(out) :: a
     end subroutine fill_array
  end interface
  call fill_array(a)
  write(*, '(i4)') a
end program dummy_array

subroutine fill_array(a)
  implicit none
  ! argument declaration
  integer, dimension(:), intent(out) :: a
  ! local variable
  integer :: i, size_a
  size_a = size(a)
  do i = 1,size_a
     a(i) = i
  end do
end subroutine fill_array
\end{minted}

Note that the \texttt{interface} block is required. In the block, only the arguments to the routines need be type-cast.

In order to avoid writing such blocks over and over, utilize a module structure as follows:
\begin{minted}[]{fortran}
module mod
contains
  subroutine fill_array(a)
    implicit none
    ! argument declaration
    integer, dimension(:), intent(out) :: a
    ! local variable
    integer :: i, size_a
    size_a = size(a)
    do i = 1,size_a
       a(i) = i
    end do
  end subroutine fill_array
end module mod

program dummy_array
  use mod
  implicit none
  integer, dimension(10) :: a
  call fill_array(a)
  write(*, '(i4)') a
end program dummy_array
\end{minted}
