fortran90/doc/readme.org
** fftshift
#+BEGIN_SRC fortran :results verbatim
  implicit none
  integer, parameter :: n = 4
  integer, parameter :: n2 = 2*n
  integer, parameter :: nm1 = n-1
  integer, parameter :: n2m1 = n2-1
  integer :: i, j
  integer :: ind(n2)
  real, dimension(n2) :: a
  ! real, dimension(-n:nm1) :: a1
  real, allocatable :: a1(:)
  real, dimension(n2, n2) :: m
  real, dimension(-n:nm1, -n:nm1) :: m1
  a = (/ (i, i=0,n2m1) /)
  ind = (/ (i, i=n+1,n2), (i, i=1,n) /)
  write(*, '(a/ *(i7))') 'fftshift index:', ind
  ! a1(-n:-1) = a(n+1:n2)
  ! a1(0:nm1) = a(1:n)
  allocate(a1(-n:nm1))
  a1 = a(ind)
  write(*, '(/a/ *(f7.2))') 'original vector:', a
  write(*, '(/a/ *(f7.2))') 'post-fftshift:', a1

  m(1:n, n+1:n2) = 1.0
  m(1:n, 1:n) = 2.0
  m(n+1:n2, 1:n) = 3.0
  m(n+1:n2, n+1:n2) = 4.0
  write(*, '(/a)') 'original matrix:'
  do i = 1,n2
     write(*, '(*(f7.1))') m(i,:)
  end do

  ! m = m(:,ind)
  ! m1 = m(ind,:)
  ! The single line below is equivalent to the two lines above.
  m1 = m(ind,ind)
  write(*, '(/a)') 'post-fftshift:'
  do i = -n,nm1
     write(*, '(*(f7.1))') m1(i,:)
  end do
#+END_SRC

#+RESULTS:
#+begin_example
fftshift index:
      5      6      7      8      1      2      3      4

original vector:
   0.00   1.00   2.00   3.00   4.00   5.00   6.00   7.00

post-fftshift:
   4.00   5.00   6.00   7.00   0.00   1.00   2.00   3.00

original matrix:
    2.0    2.0    2.0    2.0    1.0    1.0    1.0    1.0
    2.0    2.0    2.0    2.0    1.0    1.0    1.0    1.0
    2.0    2.0    2.0    2.0    1.0    1.0    1.0    1.0
    2.0    2.0    2.0    2.0    1.0    1.0    1.0    1.0
    3.0    3.0    3.0    3.0    4.0    4.0    4.0    4.0
    3.0    3.0    3.0    3.0    4.0    4.0    4.0    4.0
    3.0    3.0    3.0    3.0    4.0    4.0    4.0    4.0
    3.0    3.0    3.0    3.0    4.0    4.0    4.0    4.0

post-fftshift:
    4.0    4.0    4.0    4.0    3.0    3.0    3.0    3.0
    4.0    4.0    4.0    4.0    3.0    3.0    3.0    3.0
    4.0    4.0    4.0    4.0    3.0    3.0    3.0    3.0
    4.0    4.0    4.0    4.0    3.0    3.0    3.0    3.0
    1.0    1.0    1.0    1.0    2.0    2.0    2.0    2.0
    1.0    1.0    1.0    1.0    2.0    2.0    2.0    2.0
    1.0    1.0    1.0    1.0    2.0    2.0    2.0    2.0
    1.0    1.0    1.0    1.0    2.0    2.0    2.0    2.0
#+end_example

* Testing area
#+BEGIN_SRC fortran :results verbatim
    implicit none
    ! argument declaration
    integer, parameter :: n = 512
    integer, parameter :: rk = 8
    integer :: i, j, k
    real(8) :: rho = 0.5d0
    real(8) :: beta = 0.d0
    real(8) :: pi = 4.d0*atan(1.d0)
    real(8) :: M(n,n)
    real(8) :: nu(n)
    complex(8) :: eta(n), zeta(n), etah(n), integ(n,n), etahm(n,n)

    nu = (/ (2*pi*i/n, i=0,n-1) /)
    eta = exp( cmplx(0.0, 1.0, kind=8) * nu )
    zeta = (eta-beta)/(1.0_rk-beta*eta)
    etah = (rho**2/zeta+beta)/(1.0_rk+beta*(rho**2/zeta))
    ! write (*, '(2es25.10)') etah

    integ = cmplx(spread(eta, 1, n) ** spread((/ (k-1, k=1,n) /), 2, n), kind=rk)
    etahM = spread(etah, 1, n)
    do j = 1,n
       integ = cmplx(integ*etahM, kind=rk)
       M(:,j) = 1/real(n, rk)*real(sum(integ, 2), rk)
    end do
    do i = 1,1
       do j = n-4,n
          ! write(*, '(2x, i4, 2x, i4, 2x, es16.5e3)') i, j, M(i,j)
          write(*, '(2x, i4, 2x, i4, 2x, e16.5E3)') i, j, M(i,j)
       end do
    end do
#+END_SRC

#+RESULTS:
: 1   508      0.10711E-319
: 1   509      0.18824E-320
: 1   510      0.63240E-321
: 1   511      0.44960E-321
: 1   512      0.55627E-308

#+BEGIN_SRC fortran :results verbatim
  implicit none
  real(8) :: a(3,3), b(3)
  integer :: i, ind(3)

  a(1,1) = 1.0D+00
  a(1,2) = 2.0D+00
  a(1,3) = 3.0D+00

  a(2,1) = 4.0D+00
  a(2,2) = 5.0D+00
  a(2,3) = 6.0D+00

  a(3,1) = 7.0D+00
  a(3,2) = 8.0D+00
  a(3,3) = 0.0D+00

  b = (/ 1.d0, 2.d0, 3.d0 /)
  ind = (/ 1, 2, 3 /)

  print *, size(a)
  print *, reshape(a, (/9/))
  print *, sum( a(1,ind)*b )
  print *, matmul( a(1:2,ind), b )
#+END_SRC

#+RESULTS:
: 9
: 1.0000000000000000        4.0000000000000000        7.0000000000000000        2.0000000000000000        5.0000000000000000        8.0000000000000000        3.0000000000000000        6.0000000000000000        0.0000000000000000
: 14.000000000000000
: 14.000000000000000        32.000000000000000

*Signum function*
#+BEGIN_SRC fortran
  program test_sign
    implicit none
    real(8) :: sgn

    print *, sgn(3)
    print *, sgn(0)
    print *, sgn(-3)
  end program test_sign

  function sgn(n)
    implicit none
    integer :: n
    real(8) :: sgn
    if (n > 0) then
       sgn = 1.d0
    else if (n == 0) then
       sgn = 0.d0
    else
       sgn = -1.d0
    end if
  end function sgn
#+END_SRC

#+RESULTS:
|  1.0 |
|  0.0 |
| -1.0 |

*integer kind*
#+BEGIN_SRC fortran
  print *, (/ (i, i=1, 5) /)
#+END_SRC

#+RESULTS:
: 1           2           3           4           5
