fortran90/doc/readme.tex

\section{Testing area}
\label{sec:org311825d}
\begin{minted}[]{fortran}
implicit none
! argument declaration
integer, parameter :: n = 512
integer, parameter :: rk = 8
integer :: i, j, k
real(8) :: rho = 0.5d0
real(8) :: beta = 0.d0
real(8) :: pi = 4.d0*atan(1.d0)
real(8) :: M(n,n)
real(8) :: nu(n)
complex(8) :: eta(n), zeta(n), etah(n), integ(n,n), etahm(n,n)

nu = (/ (2*pi*i/n, i=0,n-1) /)
eta = exp( cmplx(0.0, 1.0, kind=8) * nu )
zeta = (eta-beta)/(1.0_rk-beta*eta)
etah = (rho**2/zeta+beta)/(1.0_rk+beta*(rho**2/zeta))
! write (*, '(2es25.10)') etah

integ = cmplx(spread(eta, 1, n) ** spread((/ (k-1, k=1,n) /), 2, n), kind=rk)
etahM = spread(etah, 1, n)
do j = 1,n
   integ = cmplx(integ*etahM, kind=rk)
   M(:,j) = 1/real(n, rk)*real(sum(integ, 2), rk)
end do
do i = 1,1
   do j = n-4,n
      ! write(*, '(2x, i4, 2x, i4, 2x, es16.5e3)') i, j, M(i,j)
      write(*, '(2x, i4, 2x, i4, 2x, e16.5E3)') i, j, M(i,j)
   end do
end do
\end{minted}

\begin{minted}[]{fortran}
implicit none
real(8) :: a(3,3), b(3)
integer :: i

a(1,1) = 1.0D+00
a(1,2) = 2.0D+00
a(1,3) = 3.0D+00

a(2,1) = 4.0D+00
a(2,2) = 5.0D+00
a(2,3) = 6.0D+00

a(3,1) = 7.0D+00
a(3,2) = 8.0D+00
a(3,3) = 0.0D+00

b = (/ 1.d0, 2.d0, 3.d0 /)
print *, size(a)
print *, reshape(a, (/9/))
\end{minted}
\end{document}
